tutorials/viscoelastic/viscoelasticFluidFoam/S-MDCPP/constant/viscoelasticProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      viscoelasticProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/*
From:
Wei Wang; Xikui Li; Xianhong Han. A numerical study of constitutive models
endowed with Pom-Pom molecular attributes.Journal of Non-Newtonian
Fluid Mechanics, v. 165,p. 1480-1493, 2010.

Table 2
Parameters for the S-MDCPP model
G (Pa)   859.6
l (s)    20
lob/los  2
q        4
zeta     0.025

*/

rheology
{

                type S_MDCPP;
                rho              rho [1 -3 0 0 0 0 0] 850;
                etaS             etaS [1 -1 -1 0 0 0 0] 0.002;
                etaP             etaP [1 -1 -1 0 0 0 0] 17192;
                lambdaOb         lambdaOb [0 0 1 0 0 0 0] 20;
                lambdaOs         lambdaOs [0 0 1 0 0 0 0] 10;
                zeta             zeta [0 0 0 0 0 0 0] 0.025;
                q                q [0 0 0 0 0 0 0] 4.0;

}

// ************************************************************************* //
